In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(
    {
        "key": ["A", "B", "C"],
        "value1": [1, 2, 3]
    }
)

df2 = pd.DataFrame(
    {
        "key": ["B", "C", "D"],
        "value2": [4 , 5, 6]
    }
)

In [3]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [4]:
df2

  key  value2
0   B       4
1   C       5
2   D       6

In [5]:
# Return the rows that match with the "key" | merge
pd.merge(df1, df2)

  key  value1  value2
0   B       2       4
1   C       3       5

In [6]:
pd.merge(df1, df2, on="key", how="inner")

  key  value1  value2
0   B       2       4
1   C       3       5

In [7]:
# outer
pd.merge(df1, df2, on="key", how="outer")

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     4.0
2   C     3.0     5.0
3   D     NaN     6.0

In [8]:
# left
pd.merge(df1, df2, on="key", how="left")

  key  value1  value2
0   A       1     NaN
1   B       2     4.0
2   C       3     5.0

In [9]:
pd.merge(df1, df2, on="key", how="right")

  key  value1  value2
0   B     2.0       4
1   C     3.0       5
2   D     NaN       6

In [11]:
# Examples for concatenate
df3 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2"],
        "B": ["B0", "B1", "B2"]
    }
)

df4 = pd.DataFrame(
    {
        "A": ["A3", "A4", "A5"],
        "B": ["B3", "B4", "B5"]
    }
)

In [12]:
df3

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [13]:
df4

    A   B
0  A3  B3
1  A4  B4
2  A5  B5

In [15]:
# vertical concatenation | axis 0 by default
pd.concat([df3, df4])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [18]:
# horizontal concatenation | axis = 1
pd.concat([df3, df4], axis=1)

    A   B   A   B
0  A0  B0  A3  B3
1  A1  B1  A4  B4
2  A2  B2  A5  B5

In [19]:
# join --> using an index or a column
df5 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2"],
        "B": ["B0", "B1", "B2"],
    },
    index=["K0", "K1", "K2"]
)

df6 = pd.DataFrame(
    {
        "C": ["C0", "C1", "C2"],
        "D": ["D0", "D1", "D2"]
    },
    index=["K0", "K1", "K2"]
)

In [20]:
df5

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [21]:
df6

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [23]:
# join between df5 and df6
df5.join(df6, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2